Examinator/src/Documents/ПопыткаВыполненияАктивногоРесурсаSCORM/ПопыткаВыполненияАктивногоРесурсаSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияАктивногоРесурсаSCORM</name>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СводЗнаний</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержанияСводаЗнаний</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <comment>exit &lt;> suspend</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВыхода</name>
    <comment>exit</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеВыполнения</name>
    <comment>completion_status</comment>
    <type>
      <types>EnumRef.СостоянияВыполненияОбъектовSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <comment>progress_measure</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееПоложение</name>
    <comment>Location</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПопытки</name>
    <comment>suspend_data</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПоследнейСессии</name>
    <comment>session_time</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяПродолжительностьСессий</name>
    <comment>total_time</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПрохождения</name>
    <comment>success_status</comment>
    <type>
      <types>EnumRef.СостоянияПрохожденияОбъектовSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <comment>score.raw</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВПроцентах</name>
    <comment>score.scaled</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноВозможныйРезультат</name>
    <comment>score.max</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноВозможныйРезультат</name>
    <comment>score.min</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомментарииПользователей</name>
    <comment>comments_from_learner</comment>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <comment>Comment</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееПоложение</name>
      <comment>Location</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Интерактивности</name>
    <comment>interactions</comment>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <comment>id</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <comment>type</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <comment>timestamp</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесОценки</name>
      <comment>weighting</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтветПользователя</name>
      <comment>learner_response</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <comment>result</comment>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <comment>latency</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <comment>description</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Цели</name>
      <comment>objectives (тип: Массив, Индекс: Номер, Значение: id)</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерныеОтветы</name>
      <comment>correct_responses (тип: Массив, Ключ: Индекс, Значение: pattern)</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Цели</name>
    <comment>objectives</comment>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <comment>id</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <comment>score.raw</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатВПроцентах</name>
      <comment>score.scaled</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноВозможныйРезультат</name>
      <comment>score.max</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноВозможныйРезультат</name>
      <comment>score.min</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПрохождения</name>
      <comment>success_status</comment>
      <type>
        <types>EnumRef.СостоянияПрохожденияОбъектовSCORM</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеВыполнения</name>
      <comment>completion_status</comment>
      <type>
        <types>EnumRef.СостоянияВыполненияОбъектовSCORM</types>
      </type>
    </attributes>
    <attributes>
      <name>Прогресс</name>
      <comment>progress_measure</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <comment>description</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сессии</name>
    <attributes>
      <name>ДатаИнициализации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗакрытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатистикаПараметров</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>EnumRef.ИспользуемыеПараметрыSCORM</types>
      </type>
    </attributes>
    <attributes>
      <name>Передан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданСОшибкой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПрохожденияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистратора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ИспользуемыеПараметрыSCORM/ИспользуемыеПараметрыSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИспользуемыеПараметрыSCORM</name>
  <enumValues>
    <name>completion_status</name>
  </enumValues>
  <enumValues>
    <name>progress_measure</name>
  </enumValues>
  <enumValues>
    <name>session_time</name>
  </enumValues>
  <enumValues>
    <name>exit</name>
  </enumValues>
  <enumValues>
    <name>success_status</name>
  </enumValues>
  <enumValues>
    <name>score</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/СостоянияВыполненияОбъектовSCORM/СостоянияВыполненияОбъектовSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВыполненияОбъектовSCORM</name>
  <comment>completion_status</comment>
  <enumValues>
    <name>completed</name>
  </enumValues>
  <enumValues>
    <name>incomplete</name>
  </enumValues>
  <enumValues>
    <name>notAttempted</name>
  </enumValues>
  <enumValues>
    <name>unknown</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/СостоянияПрохожденияОбъектовSCORM/СостоянияПрохожденияОбъектовSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПрохожденияОбъектовSCORM</name>
  <comment>success_status</comment>
  <enumValues>
    <name>passed</name>
  </enumValues>
  <enumValues>
    <name>failed</name>
  </enumValues>
  <enumValues>
    <name>unknown</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПопыткаВыполненияАктивногоРесурсаSCORM/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем ТаблицаСтатистикиПараметровSCORM Экспорт;
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// 1. Движение по регистру ПопыткиПрохожденияЭлектронныхРесурсовСУЗ 
	
	Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Записывать = Истина;
	
	Если ЭлектронныеРесурсыПереопределяемый.ОбучениеОтменено(Отменено, ПрохождениеОбучения, Задание) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьДвижения();
	
КонецПроцедуры

Функция ПараметрSCORMИспользуется(Параметр, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM)
	
	СтрокаТСП = ТаблицаСтатистикиПараметровSCORM.Найти(Параметр, "Параметр");
	
	Если СтрокаТСП <> Неопределено Тогда
		Если НЕ СтрокаТСП.Передан Тогда
			Возврат Ложь;
		КонецЕсли;
		Если СтрокаТСП.ПереданСОшибкой Тогда
			Возврат Ложь;
		КонецЕсли;		
	КонецЕсли;
	
	СтрокаТН = НастройкиПакетаSCORM.ТаблицаНастроек.Найти(Параметр, "Параметр");
	
	Если СтрокаТН <> Неопределено Тогда
		Возврат СтрокаТН.Используется;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура СформироватьДвижения() Экспорт

	// Заполняем таблицу статистики использования параметров SCORM
	
	ТаблицаСтатистикиПараметровSCORM = Перечисления.ИспользуемыеПараметрыSCORM.НоваяТаблицаСтатистикиПараметровSCORM();	
	
	Если ДополнительныеСвойства.Свойство("ЭтоПолучениеСтатистикиSCORM")
		И ДополнительныеСвойства.ЭтоПолучениеСтатистикиSCORM Тогда
		НастройкиПакетаSCORM  = Справочники.РесурсыСУЗ.НастройкиSCORMДляПолученияСтатистики();
	Иначе
		НастройкиПакетаSCORM  = Справочники.РесурсыСУЗ.НастройкиПакетаSCORM(Ресурс);
	КонецЕсли;
	
	Если СтатистикаПараметров.Количество() = 0 Тогда
		
		СоответствиеРеквизитовИПараметров = Новый Соответствие;
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.completion_status, "СостояниеВыполнения");	
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.exit, "ПричинаВыхода");
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.progress_measure, "ПроцентВыполнения");
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.score, "Результат");
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.session_time, "ПродолжительностьПоследнейСессии");
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.success_status, "СостояниеПрохождения");		
		
		Для каждого ЭлементСоответствия Из СоответствиеРеквизитовИПараметров Цикл
			
			ТекущееЗначение = ЭтотОбъект[ЭлементСоответствия.Значение];
			
			Если ТекущееЗначение = Перечисления.СостоянияВыполненияОбъектовSCORM.unknown Тогда
				ТекущееЗначение = Неопределено;
			КонецЕсли;
			
			Если ТекущееЗначение = Перечисления.СостоянияПрохожденияОбъектовSCORM.unknown Тогда
				ТекущееЗначение = Неопределено;
			КонецЕсли;			
			
			Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
				ТаблицаСтатистикиПараметровSCORM,
				СводЗнаний,
				ЭлементСодержанияСводаЗнаний,
				ЭлементСоответствия.Ключ,
				ЗначениеЗаполнено(ТекущееЗначение),
				Ложь,
				ТекущееЗначение);				
		
		КонецЦикла;
		
	Иначе
		
		Для каждого СтрокаСПТЧ Из СтатистикаПараметров Цикл
			
			Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
				ТаблицаСтатистикиПараметровSCORM,
				СводЗнаний,
				ЭлементСодержанияСводаЗнаний,
				СтрокаСПТЧ.Параметр,
				СтрокаСПТЧ.Передан,
				СтрокаСПТЧ.ПереданСОшибкой,
				СтрокаСПТЧ.Значение);
				
		КонецЦикла;		
		
	КонецЕсли;	
	
	Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
	
	Движение.Период                   = Дата;
	Движение.Пользователь             = Пользователь;
	Движение.ЭлементСодержания        = ЭлементСодержанияСводаЗнаний;
	Движение.ПрохождениеОбучения      = ПрохождениеОбучения;
	Движение.Задание                  = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, СводЗнаний, Задание);
	Движение.ЭлектронныйРесурс        = СводЗнаний;
	Движение.СсылкаНаОбъектСУЗ        = Ресурс;
	Движение.ДатаНачалаПрохождения    = ДатаНачалаВыполнения;
	Движение.ДатаОкончанияПрохождения = Дата;
	Движение.ЭтоТест                  = Ложь;
	Движение.НомерРегистратора        = Номер;
	
	ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);
	
	// Попытка завершена
	
	Движение.ПопыткаЗавершена = Ложь;
	
	Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.completion_status, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
		
		Если СостояниеВыполнения = Перечисления.СостоянияВыполненияОбъектовSCORM.completed Тогда			
			Движение.ПопыткаЗавершена = Истина;
		КонецЕсли;
		
	Иначе
		
		Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.success_status, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
			Если СостояниеПрохождения = Перечисления.СостоянияПрохожденияОбъектовSCORM.failed
				ИЛИ СостояниеПрохождения = Перечисления.СостоянияПрохожденияОбъектовSCORM.passed Тогда
				Движение.ПопыткаЗавершена = Истина;
			КонецЕсли;			
		КонецЕсли;
		
		Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.progress_measure, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
			Если ПроцентВыполнения = 100 Тогда
				Движение.ПопыткаЗавершена = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.score, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
			Движение.ПопыткаЗавершена = Истина;	
		КонецЕсли;

	КонецЕсли;
	
	Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.exit, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
		Если ПричинаВыхода = "suspend" Тогда
			Движение.ПопыткаЗавершена = Ложь;
		Иначе
			Движение.ПопыткаЗавершена = Истина;
		КонецЕсли;
	КонецЕсли;	
			
	// Результат
	
	Движение.ВыставляетсяОценка = ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.score, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM);
	
	Движение.Результат = 0;
	
	Если Движение.ПопыткаЗавершена Тогда
		
		Если Движение.ВыставляетсяОценка Тогда
			
			Если ЗначениеЗаполнено(РезультатВПроцентах) Тогда
				Если РезультатВПроцентах < 0 Тогда
					Движение.Результат = 0;
				Иначе
					Движение.Результат = РезультатВПроцентах * 100;
				КонецЕсли;
			Иначе
				Если (МинимальноВозможныйРезультат + МаксимальноВозможныйРезультат) = 0 Тогда
					Движение.Результат = 0;
				Иначе
					Движение.Результат = (Результат / (МинимальноВозможныйРезультат + МаксимальноВозможныйРезультат))*100;
				КонецЕсли;
			КонецЕсли;		
			
		Иначе
			
			Движение.Результат = 100;
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Прогресс
	
	Если Движение.ПопыткаЗавершена Тогда
		Движение.ЗавершеноВПроцентах = 100;
	Иначе
		Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.progress_measure, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
			Движение.ЗавершеноВПроцентах = ПроцентВыполнения * 100;
		Иначе
			Движение.ЗавершеноВПроцентах = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если Движение.ЗавершеноВПроцентах > 100 Тогда
		Движение.ЗавершеноВПроцентах = 100;
	КонецЕсли;		
	
	// Время сессии
	
	Движение.ВремяПрохожденияВСекундах = 0;
	
	Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.session_time, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
		Движение.ВремяПрохожденияВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундВременногоИнтервалаSCORM(ОбщаяПродолжительностьСессий);
	Иначе
		Для каждого ДанныеСессии Из Сессии Цикл
			Если НЕ ЗначениеЗаполнено(ДанныеСессии.ДатаИнициализации) Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ДанныеСессии.ДатаЗакрытия) Тогда
				Продолжить;
			КонецЕсли;
			Движение.ВремяПрохожденияВСекундах = Движение.ВремяПрохожденияВСекундах
				+ Число(ДанныеСессии.ДатаЗакрытия - ДанныеСессии.ДатаИнициализации);				
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
